[
    {
        "id": 1,
        "name": "Vintage Roadster",
        "picture": "https://i.ibb.co/d24RpyB/pexels-alexgtacar-1592384.jpg",
        "price": 29.99,
        "rating": 4.5,
        "details": "The Vintage Roadster is a classic toy car inspired by vintage roadsters. It features a timeless design that captures the essence of retro automobiles. With its sleek lines and attention to detail, this toy car brings a touch of nostalgia to playtime. The Vintage Roadster is produced by ToyCo, known for their commitment to quality and craftsmanship. It is made with high-quality materials to ensure durability and longevity. Whether it's for display or imaginative play, the Vintage Roadster is sure to provide hours of enjoyment for car enthusiasts of all ages.",
        "producer": "ToyCo",
        "quality": "High"
    },
    {
        "id": 2,
        "name": "Speedy Racer",
        "picture": "https://i.ibb.co/YtdrgFM/pexels-arnie-watkins-3156482.jpg",
        "price": 19.99,
        "rating": 4.2,
        "details": "The Speedy Racer is a sleek and fast toy car designed for racing enthusiasts. Its aerodynamic design and powerful engine make it perfect for zooming around the track or competing with friends. With its vibrant colors and sporty appearance, the Speedy Racer stands out from the crowd. It is manufactured by PlayTime, a renowned toy company known for their commitment to creating exciting and engaging play experiences. The Speedy Racer offers a balance of speed and control, making it suitable for both beginners and experienced racers. Its medium quality construction ensures reliability and durability during intense racing sessions. Get ready to rev up the engines and experience thrilling races with the Speedy Racer!",
        "producer": "PlayTime",
        "quality": "Medium"
    },
    {
        "id": 3,
        "name": "Chrome Cruiser",
        "picture": "https://i.ibb.co/4pbTQH1/pexels-mike-bird-132539.jpg",
        "price": 24.99,
        "rating": 4.0,
        "details": "The Chrome Cruiser is a toy car that combines a shiny chrome exterior with a retro design. Its eye-catching appearance makes it stand out in any collection or playtime setting. The Chrome Cruiser is perfect for kids and collectors who appreciate classic aesthetics. Produced by FunToys, a trusted toy manufacturer, this car guarantees a high-quality product. The Chrome Cruiser offers a smooth and enjoyable play experience, whether it's cruising along imaginary roads or participating in exciting adventures. Its sleek lines and attention to detail showcase the craftsmanship and dedication to quality. Add a touch of nostalgia and style to your toy car collection with the Chrome Cruiser.",
        "producer": "FunToys",
        "quality": "High"
    }
]