[
    {
        "id": 1,
        "name": "Super Sports",
        "picture": "https://i.ibb.co/st8sTk6/pexels-jay-pizzle-15489298.jpg",
        "price": 49.99,
        "rating": 4.8,
        "details": "The Super Sports is a luxury toy car that replicates the style and performance of high-end sports cars. With its sleek and aerodynamic design, this toy car exudes elegance and sophistication. The Super Sports is perfect for kids and collectors who appreciate the finer things in life. Produced by EliteToys, a reputable brand known for their attention to detail and exceptional quality, this car offers a premium play experience. The Super Sports features realistic elements such as detailed interiors, glossy paint finish, and precision-engineered wheels. Its high-quality construction ensures durability and longevity, making it a prized possession for any toy car enthusiast. Get ready to experience the thrill of driving a luxury sports car with the Super Sports!",
        "producer": "EliteToys",
        "quality": "Premium"
    },
    {
        "id": 2,
        "name": "Golden Limousine",
        "picture": "https://i.ibb.co/1LNZs0L/pexels-mike-bird-97353.jpg",
        "price": 59.99,
        "rating": 4.6,
        "details": "The Golden Limousine is a luxurious toy car modeled after a glamorous limousine. With its golden exterior and elegant design, this toy car radiates opulence and sophistication. It's perfect for kids who want to play out luxurious scenarios or collectors who appreciate high-end vehicles. The Golden Limousine is produced by LuxuryPlay, a renowned brand known for their commitment to creating premium toys. The attention to detail in this car is exceptional, from the intricately designed interiors to the shimmering golden finish. The Golden Limousine offers a touch of grandeur and allows kids to imagine themselves as VIPs or celebrities. With its premium quality construction, this toy car guarantees durability and hours of imaginative play. Experience the luxury and style of a limousine with the Golden Limousine toy car!",
        "producer": "LuxuryPlay",
        "quality": "Premium"
    },
    {
        "id": 3,
        "name": "Diamond Edition",
        "picture": "https://i.ibb.co/r7T1Sgp/pexels-pixabay-358070.jpg",
        "price": 99.99,
        "rating": 4.9,
        "details": "The Diamond Edition is an exclusive toy car that embodies luxury and extravagance. This extraordinary car is adorned with diamond accents and features premium craftsmanship. Every detail of the Diamond Edition is meticulously designed to create a truly remarkable toy car. From its sparkling exterior to its exquisite interior, this car exudes elegance and sophistication. Produced by PrestigeToys, a brand synonymous with unparalleled quality and craftsmanship, the Diamond Edition is a testament to their commitment to creating exceptional toys. With its attention-grabbing design and top-notch build quality, this car is a collector's dream. The Diamond Edition offers a truly unique and lavish play experience, making it a prized possession for those who appreciate the finer things in life. Indulge in the ultimate luxury with the Diamond Edition toy car!",
        "producer": "PrestigeToys",
        "quality": "Luxury"
    }
]